<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"9495b1d6fb913fd6291968cd92361a6efccd7a1db63fca31e14d4aae4a3a08b9","plan_job_ref":"Job Analyse #813 at https://github.com/coverage-robot/core/actions/runs/6660565609","plan_hash":"5ef19aec3bd8d97e36707043edce9a8417d71753c62b46c3fa469f0b68b82694","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __./services/analyse/infrastructure__ in the __prod__ workspace
With var files: `./services/analyse/infrastructure/prod.tfvars`
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.analyse.aws_iam_policy.analyse_policy will be updated in-place
  ~ resource "aws_iam_policy" "analyse_policy" {
        id        = "arn:aws:iam::952005856579:policy/analyse-policy"
        name      = "analyse-policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:*:*:*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "events:PutEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:eu-west-2:952005856579:coverage-publish-prod.fifo",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:DescribeTable",
                          - "dynamodb:Get*",
                          - "dynamodb:Query",
                          - "dynamodb:Scan",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:eu-west-2:952005856579:table/coverage-analyse-query-cache-prod",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.analyse.aws_lambda_function.analyse will be updated in-place
  ~ resource "aws_lambda_function" "analyse" {
        id                             = "coverage-analyse-prod"
      ~ last_modified                  = "2023-10-26T22:42:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "q3R/3rFyn89XLx8sNtksU2Spfuh3uPTeMJqCSES9pkg=" -> "naPTZyFzzGKnYWaOZoXkstbDxwf837d2m9H3JoujLxI="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.query_cache.aws_dynamodb_table.cache_table will be created
  + resource "aws_dynamodb_table" "cache_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PROVISIONED"
      + deletion_protection_enabled = true
      + hash_key                    = "********"
      + id                          = (known after apply)
      + name                        = "coverage-analyse-query-cache-prod"
      + read_capacity               = 5
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags_all                    = (known after apply)
      + write_capacity              = 5

      + attribute {
          + name = "cacheKey"
          + type = "S"
        }

      + ttl {
          + attribute_name = "expiry"
          + enabled        = true
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on query_cache/main.tf line 20, in resource "aws_dynamodb_table" "cache_table":
  20:     ignore_changes = ["write_capacity", "read_capacity"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [Analyse #813](https://github.com/coverage-robot/core/actions/runs/6660565609)